src/cf/DataProcessors/ор_ЗагрузкаАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ор_ЗагрузкаАналогов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Обратимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ор_ЗагрузкаАналогов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОтборВсе.Пометка = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФайлДанныхНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)

	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр 	= "Файл данных (*.xls, *.xlsx)|*.xls;*.xlsx";
	ПараметрыДиалога.Заголовок 	= НСтр("ru='Выберите файл!'");
	
	ОписаниеЗавершения = Новый ОписаниеОповещения("ЗавершениеПомещениеФайла", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(ОписаниеЗавершения,,,, ПараметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоДляОтображения

&НаКлиенте
Процедура ДеревоДляОтображенияПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоДляОтображения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НаложитьОтборНаСопоставленныеПозиции(ТекущиеДанные.Номенклатура, ТекущиеДанные.КлючСвязи);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляОтображенияВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоДляОтображения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.ЭтоВерхнийУровень Тогда
		Для Каждого СтрокаДерева Из ТекущиеДанные.ПолучитьЭлементы() Цикл
			СтрокаДерева.Выбран = ТекущиеДанные.Выбран;
			ЗаполнитьПометкуВАналогах(СтрокаДерева.Номенклатура, СтрокаДерева.Выбран);
			ЗаполнитьПометкуВТаблицеЗагрузки(СтрокаДерева.КлючСвязи, СтрокаДерева.Выбран);
		КонецЦикла;
	Иначе
		ЗаполнитьПометкуВАналогах(ТекущиеДанные.Номенклатура, ТекущиеДанные.Выбран);
		ЗаполнитьПометкуВТаблицеЗагрузки(ТекущиеДанные.КлючСвязи, ТекущиеДанные.Выбран);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляОтображенияНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоДляОтображения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МНН = ТекущиеДанные.ПолучитьРодителя().МНН;
	
	ДеревоДляОтображенияНоменклатураПриИзмененииНаСервере(
		ТекущиеДанные.КлючСвязи,
		МНН,
		ТекущиеДанные.Номенклатура);
	
	НаложитьОтборНаСопоставленныеПозиции(ТекущиеДанные.Номенклатура, ТекущиеДанные.КлючСвязи);
	ОбновитьКоличественнуюИнформациюВОтборах();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДляОтображенияПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	УдалитьСтрокуДерева();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСопоставленныеАналоги

&НаКлиенте
Процедура СопоставленныеАналогиКоэффициентПриИзменении(Элемент)
	
	ОбновитьДанныеВОбратнойЗаписиАналога(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставленныеАналогиИдентичныПриИзменении(Элемент)
	
	ОбновитьДанныеВОбратнойЗаписиАналога(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставленныеАналогиПриоритетПриИзменении(Элемент)
	
	ОбновитьДанныеВОбратнойЗаписиАналога(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставленныеАналогиКомментарийПриИзменении(Элемент)
	
	ОбновитьДанныеВОбратнойЗаписиАналога(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВОбратнойЗаписиАналога(Элемент)
	
	ТекущиеДанные = Элементы.СопоставленныеАналоги.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Аналог", 		 ТекущиеДанные.Номенклатура);
	СтруктураПоиска.Вставить("Номенклатура", ТекущиеДанные.Аналог);
	
	ОбратнаяЗапись = СопоставленныеАналоги.НайтиСтроки(СтруктураПоиска);
	Если ОбратнаяЗапись.Количество() > 0 Тогда
		
		Если ТекущиеДанные.Идентичны Тогда
			
			// Если установлен флаг идентичны и меняется коээфициент, обновим его в обратной записи.
			Если Элемент.Имя = "СопоставленныеАналогиКоэффициент" Тогда
				ОбратнаяЗапись[0].ор_Коэффициент = ТекущиеДанные.ор_Коэффициент;
			КонецЕсли;
			
			Если Элемент.Имя = "СопоставленныеАналогиПриоритет" Тогда
				ОбратнаяЗапись[0].Приоритет = ТекущиеДанные.Приоритет;
			КонецЕсли;
			
			Если Элемент.Имя = "СопоставленныеАналогиИдентичны" Тогда
				ОбратнаяЗапись[0].Идентичны 		= Истина;
				ОбратнаяЗапись[0].ор_Коэффициент 	= ТекущиеДанные.ор_Коэффициент;
				ОбратнаяЗапись[0].Приоритет 		= ТекущиеДанные.Приоритет;
				ОбратнаяЗапись[0].Комментарий 		= ТекущиеДанные.Комментарий;
			КонецЕсли;
			
			Если Элемент.Имя = "СопоставленныеАналогиКомментарий" Тогда
				ОбратнаяЗапись[0].Комментарий = ТекущиеДанные.Комментарий;
			КонецЕсли;
			
		Иначе
			// Если флаг не установлен, меняем только у этой записи, 
			//при этом флаг идентичны сбрасывается у обратной записи.
			ОбратнаяЗапись[0].Идентичны = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КоманднаяПанельТаблицыЗагрузки

&НаКлиенте
Процедура УстановитьФлажкиЗагрузки(Команда)
	УстановитьИлиСнятьФлажкиДерева(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиЗагрузки(Команда)
	УстановитьИлиСнятьФлажкиДерева(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиСтраниц(Команда)
	УстановитьИлиСнятьФлажкиСтраниц(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажкиСтраниц(Команда)
	УстановитьИлиСнятьФлажкиСтраниц(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоАналогов(Команда)
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		Элементы.ДеревоДляОтображения.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДеревоАналогов(Команда)
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		Элементы.ДеревоДляОтображения.Свернуть(СтрокаДерева.ПолучитьИдентификатор());
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВыбранные(Команда)
	СопоставитьВыбранныеНаСервере();
	ДеревоДляОтображенияПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область КомандыПереходаПоСтраницам

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ОчиститьСообщения();
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ЗагрузкаДанныхИзФайла Тогда
		
		Если ПустаяСтрока(АдресХранилищаФайла) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указан файл для загрузки!'"));
			Возврат;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Выбран", Истина);
		
		ЛистыКЗагрузке = ВыбранныеЛисты.НайтиСтроки(ПараметрыОтбора);
		
		Если ЛистыКЗагрузке.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбраны страницы для загрузки!'"));
			Возврат;
		КонецЕсли;
		
		ЗагрузитьДанныеИзФайлаВФоне();
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СопоставлениеДанных Тогда
		
		Если ПроверитьВыбранные() Тогда
			ЗагрузитьДанные();
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СопоставлениеДанных Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ЗагрузкаДанныхИзФайла;
		Элементы.Назад.Видимость = Ложь;
		Элементы.Далее.Заголовок = НСтр("ru='Далее'");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Загрузка из файла'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтборыТаблицыЗагрузки

&НаКлиенте
Процедура ОтборВсе(Команда)
	УстановитьОтборНаСервере(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборНеСопоставленные(Команда)
	УстановитьОтборНаСервере(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПрисутствующиеВБазе(Команда)
	УстановитьОтборНаСервере(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОтборСопоставленные(Команда)
	УстановитьОтборНаСервере(Команда.Имя);
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборНаСервере(ИмяКоманды)
	
	Элементы.ОтборСопоставленные.Пометка 		= Ложь;
	Элементы.ОтборНеСопоставленные.Пометка 		= Ложь;
	Элементы.ОтборПрисутствующиеВБазе.Пометка 	= Ложь;
	Элементы.ОтборВсе.Пометка 					= Ложь;
	
	Если ИмяКоманды = "ОтборСопоставленные" Тогда
		Элементы.ОтборСопоставленные.Пометка = Истина;
	ИначеЕсли ИмяКоманды = "ОтборНеСопоставленные" Тогда
		Элементы.ОтборНеСопоставленные.Пометка = Истина;
	ИначеЕсли ИмяКоманды = "ОтборПрисутствующиеВБазе" Тогда
		Элементы.ОтборПрисутствующиеВБазе.Пометка = Истина;
	ИначеЕсли ИмяКоманды = "ОтборВсе" Тогда
		Элементы.ОтборВсе.Пометка = Истина;
	КонецЕсли;
	
	ОтрисоватьДеревоСУчетомОтборов(ИмяКоманды);

КонецПроцедуры

&НаСервере
Процедура ОтрисоватьДеревоСУчетомОтборов(ИмяКоманды)
	
	ДеревоДляОтображения.ПолучитьЭлементы().Очистить();
	
	Отбор = Новый Структура();
	
	Если ИмяКоманды = "ОтборСопоставленные" Тогда
		Отбор.Вставить("НоменклатураЗаполнена", Истина);
	ИначеЕсли ИмяКоманды = "ОтборНеСопоставленные" Тогда
		Отбор.Вставить("НоменклатураЗаполнена", Ложь);
	ИначеЕсли ИмяКоманды = "ОтборПрисутствующиеВБазе" Тогда
		Отбор.Вставить("ЕстьВБазе", Истина);
	КонецЕсли;
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ДеревоДляОтображения",
		РеквизитФормыВЗначение("ДеревоДляОтображения", Тип("ДеревоЗначений")));
	ДопПараметры.Вставить("ТаблицаЗагрузки", ТаблицаЗагрузки.Выгрузить());
	ДопПараметры.Вставить("Отбор", 			 Отбор);
	
	Обработки.ор_ЗагрузкаАналогов.СформироватьДеревоДляОтображения(ДопПараметры);
	
	ДеревоНаФорме = ДанныеФормыВЗначение(ДеревоДляОтображения, Тип("ДеревоЗначений"));
	ДеревоНаФорме = ДопПараметры.ДеревоДляОтображения.Скопировать();
	ЗначениеВДанныеФормы(ДеревоНаФорме, ДеревоДляОтображения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗагрузитьДанныеАналоговВФоне(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = НСтр("ru='Загрузка аналогов'");

	ВыполняемыйМетод = "ор_ОбщегоНазначенияСервер.ЗагрузитьДанныеАналогов";
	
	ПараметрыВыполнения 		= ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	СтруктураФоновогоЗадания 	= ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаСервере
Функция СформироватьФоновоеЗадание(ДвоичныеДанныеФайла, ЭтоЗаполнениеСпискаЛистов = Ложь)
	
	ТаблицаЗагрузки.Очистить();
	СопоставленныеАналоги.Очистить();
	ДеревоДляОтображения.ПолучитьЭлементы().Очистить();
	
	КопияДереваДляОтображения = РеквизитФормыВЗначение("ДеревоДляОтображения", Тип("ДеревоЗначений"));
	
	АдресРезультатаФоновогоЗадания = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыЗапуска = Новый Структура;
	ПараметрыЗапуска.Вставить("ХранилищеДанных", 			ДвоичныеДанныеФайла);
	ПараметрыЗапуска.Вставить("Расширение", 				ПереданноеРасширение);
	ПараметрыЗапуска.Вставить("ЭтоЗаполнениеСпискаЛистов",  ЭтоЗаполнениеСпискаЛистов);
	ПараметрыЗапуска.Вставить("ТаблицаЗагрузки", 			ТаблицаЗагрузки.Выгрузить());
	ПараметрыЗапуска.Вставить("ДеревоДляОтображения", 		КопияДереваДляОтображения);
	ПараметрыЗапуска.Вставить("ВыбранныеЛисты", 			ВыбранныеЛисты.Выгрузить());
	ПараметрыЗапуска.Вставить("СопоставленныеАналоги",		СопоставленныеАналоги.Выгрузить());
	
	Возврат ЗагрузитьДанныеАналоговВФоне(ПараметрыЗапуска, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПроверитьВыбранные()
	
	ОчиститьСообщения();
	
	ПроверкаНеПройдена = Ложь;
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		Для Каждого ДочернийУзел Из СтрокаДерева.ПолучитьЭлементы() Цикл
			Если ДочернийУзел.Выбран И Не ЗначениеЗаполнено(ДочернийУзел.Номенклатура) Тогда
				ПроверкаНеПройдена = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ПроверкаНеПройдена Тогда
		
		УстановитьТекущуюСтраницуСопоставлениеДанных();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Загрузка данных не выполнена, т.к в таблице присутствуют не сопоставленные позиции, помеченные к загрузке.'"));
			
		Возврат Не ПроверкаНеПройдена;
		
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Выбран", Истина);
	
	ВыбранныеПозиции = СопоставленныеАналоги.НайтиСтроки(ПараметрыОтбора);
	Если ВыбранныеПозиции.Количество() = 0 Тогда
		
		ПроверкаНеПройдена = Истина;
		
		УстановитьТекущуюСтраницуСопоставлениеДанных();
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(
			НСтр("ru='Загрузка не выполнена, т.к отсутствуют выбранные аналоги.'"));
		
	КонецЕсли;
		
	Возврат Не ПроверкаНеПройдена;
	
КонецФункции

&НаКлиенте
Процедура ЗавершениеПомещениеФайла(ОписаниеПомещенногоФайла, Параметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено
		Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	АдресХранилищаФайла 	= ОписаниеПомещенногоФайла.Адрес;
	ФайлДанных				= ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
	ПереданноеРасширение 	= ОписаниеПомещенногоФайла.СсылкаНаФайл.Расширение;
	
	ЗагрузитьДанныеИзФайлаВФоне(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаВФоне(ЭтоЗаполнениеСпискаЛистов = Ложь)
	
	Если ПустаяСтрока(АдресХранилищаФайла)
		Или ПустаяСтрока(ПереданноеРасширение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл не найден!'"));
		Возврат;
	КонецЕсли;
	
	ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(АдресХранилищаФайла);
	Если ДвоичныеДанныеФайла = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Файл был удален!'"));
		Возврат;
	КонецЕсли;
	
	СтруктураФоновогоЗадания = СформироватьФоновоеЗадание(ДвоичныеДанныеФайла, ЭтоЗаполнениеСпискаЛистов);
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ЭтоЗаполнениеСпискаЛистов", ЭтоЗаполнениеСпискаЛистов);
	
	ОповещениеОбработатьДанные =  Новый ОписаниеОповещения(
		"ОбработатьДанные",
		ЭтотОбъект,
		ДополнительныеПараметры);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, ОповещениеОбработатьДанные, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьДанные(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		ОбработатьРезультатЗаданияНаСервере(Результат, ДополнительныеПараметры);
		
		УстановитьВидимостьЛистовИСледующегоШага(ДополнительныеПараметры.ЭтоЗаполнениеСпискаЛистов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЛистовИСледующегоШага(ЭтоЗаполнениеСпискаЛистов = Ложь)
	
	Если Не ЭтоЗаполнениеСпискаЛистов Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СопоставлениеДанных;
		Элементы.Назад.Видимость = Истина;
		Элементы.Далее.Заголовок = НСтр("ru='Загрузить'");
		Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Сопоставление данных'");
	Иначе
		Элементы.ВыбранныеЛисты.Доступность = ВыбранныеЛисты.Количество() > 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатЗаданияНаСервере(Результат, ДополнительныеПараметры)
	
	ТаблицаРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если ДополнительныеПараметры.ЭтоЗаполнениеСпискаЛистов Тогда
		ВыбранныеЛисты.Загрузить(ТаблицаРезультат);
	Иначе
		
		ДеревоНаФорме = ДанныеФормыВЗначение(ДеревоДляОтображения, Тип("ДеревоЗначений"));
		ДеревоНаФорме = ТаблицаРезультат.ДеревоДляОтображения.Скопировать();
		ЗначениеВДанныеФормы(ДеревоНаФорме, ДеревоДляОтображения);
		
		ТаблицаЗагрузки.Загрузить(ТаблицаРезультат.ТаблицаЗагрузки);
		СопоставленныеАналоги.Загрузить(ТаблицаРезультат.СопоставленныеАналоги);
		
		ОбновитьКоличественнуюИнформациюВОтборах();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличественнуюИнформациюВОтборах()
	
	ОбщееКоличество  = ТаблицаЗагрузки.Количество();
	Сопоставленные   = 0;
	НеСопоставленные = 0;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	НайденныеСтроки = ТаблицаЗагрузки.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		НеСопоставленные = НайденныеСтроки.Количество();
		Сопоставленные   = ОбщееКоличество - НеСопоставленные;
	Иначе
		Сопоставленные   = ОбщееКоличество;
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("ЕстьВБазе", Истина);
	
	ЕстьВБазе = ТаблицаЗагрузки.НайтиСтроки(Отбор);
	
	Элементы.ОтборСопоставленные.Заголовок
		= СтрШаблон(НСтр("ru = 'Сопоставленные: %1'"), Сопоставленные);
	Элементы.ОтборНеСопоставленные.Заголовок
		= СтрШаблон(НСтр("ru = 'Не сопоставленные: %1'"), НеСопоставленные);
	Элементы.ОтборПрисутствующиеВБазе.Заголовок
		= СтрШаблон(НСтр("ru = 'Присутствующие в базе: %1'"), ЕстьВБазе.Количество());
	Элементы.ОтборВсе.Заголовок
		= СтрШаблон(НСтр("ru = 'Все: %1'"), ОбщееКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИлиСнятьФлажкиДерева(Значение)
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		
		СтрокаДерева.Выбран = Значение;
		Для Каждого ДочернийУзел Из СтрокаДерева.ПолучитьЭлементы() Цикл
			ДочернийУзел.Выбран = Значение;
			ЗаполнитьПометкуВАналогах(ДочернийУзел.Номенклатура, Значение);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИлиСнятьФлажкиСтраниц(Значение)
	
	Для Каждого Страница Из ВыбранныеЛисты Цикл
		Страница.Выбран = Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДеревоДляОтображенияНоменклатураПриИзмененииНаСервере(КлючСвязи, МНН, Номенклатура)
	
	// Попробуем найти по ключу связи и обратному ключу.
	// Т.к это может быть замена одного товара на другой и нужно подменить.
	БылОтборПоКлючу = Ложь;
	
	ОтборПоКлючу = Новый Структура();
	ОтборПоКлючу.Вставить("КлючСвязи", КлючСвязи);
	
	ОтобранныеПоКлючу = СопоставленныеАналоги.НайтиСтроки(ОтборПоКлючу);
	Для Каждого Отобранный Из ОтобранныеПоКлючу Цикл
		БылОтборПоКлючу = Истина;
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			СопоставленныеАналоги.Удалить(СопоставленныеАналоги.Индекс(Отобранный));
			Продолжить;
		КонецЕсли;
		Отобранный.Номенклатура = Номенклатура;
	КонецЦикла;
	
	ОтборПоОбратномуКлючу = Новый Структура();
	ОтборПоОбратномуКлючу.Вставить("ОбратныйКлючСвязи", КлючСвязи);
	
	ОтобранныеПоОбратномуКлючу = СопоставленныеАналоги.НайтиСтроки(ОтборПоОбратномуКлючу);
	Для Каждого Отобранный Из ОтобранныеПоОбратномуКлючу Цикл 
		БылОтборПоКлючу = Истина;
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			СопоставленныеАналоги.Удалить(СопоставленныеАналоги.Индекс(Отобранный));
			Продолжить;
		КонецЕсли;
		Отобранный.Аналог = Номенклатура;
	КонецЦикла;
	
	Если БылОтборПоКлючу Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("МНН", 		МНН);
	ПараметрыПоиска.Вставить("КлючСвязи", 	КлючСвязи);
	
	МассивНайденныхСтрок = ТаблицаЗагрузки.НайтиСтроки(ПараметрыПоиска);
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		
		МассивНайденныхСтрок[0].Номенклатура = Номенклатура;
		МассивНайденныхСтрок[0].НоменклатураЗаполнена = ЗначениеЗаполнено(Номенклатура);
		
		ДопПараметры = Новый Структура();
		ДопПараметры.Вставить("ТаблицаЗагрузки",		 ТаблицаЗагрузки.Выгрузить());
		ДопПараметры.Вставить("СопоставленныеАналоги",	 СопоставленныеАналоги.Выгрузить());
		
		// Нужно обновить аналоги в разрезе МНН, т.к многие ко многим.
		ПараметрыПоиска = Новый Структура();
		ПараметрыПоиска.Вставить("МНН", МНН);
		
		РазрезМНН = ТаблицаЗагрузки.НайтиСтроки(ПараметрыПоиска);
		
		Для Каждого СтрокаТЧ Из РазрезМНН Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Обработки.ор_ЗагрузкаАналогов.НайтиИЗаполнитьАналогиПоТекущейНоменклатуре(
				СтрокаТЧ,
				ДопПараметры);
				
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из РазрезМНН Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Обработки.ор_ЗагрузкаАналогов.ОбновитьОбратныеКлючиСвязи(
				СтрокаТЧ,
				ДопПараметры);
			
		КонецЦикла;
		
		ТаблицаЗагрузки.Загрузить(ДопПараметры.ТаблицаЗагрузки);
		СопоставленныеАналоги.Загрузить(ДопПараметры.СопоставленныеАналоги);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПометкуВАналогах(Номенклатура, Выбран)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Номенклатура", Номенклатура);
	
	НайденныеАналоги = СопоставленныеАналоги.НайтиСтроки(СтруктураПоиска);
	Для Каждого Аналог Из НайденныеАналоги Цикл
		Аналог.Выбран = Выбран;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПометкуВТаблицеЗагрузки(КлючСвязи, Выбран)
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("КлючСвязи", КлючСвязи);
	
	НайденныеСтрокиЗагрузки = ТаблицаЗагрузки.НайтиСтроки(СтруктураПоиска);
	Для Каждого Строка Из НайденныеСтрокиЗагрузки Цикл
		Строка.Выбран = Выбран;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НаложитьОтборНаСопоставленныеПозиции(Номенклатура, КлючСвязи)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", 	Номенклатура);
	Отбор.Вставить("КлючСвязи", 	КлючСвязи);
	
	Если Элементы.ОтборПрисутствующиеВБазе.Пометка Тогда
		Отбор.Вставить("ЕстьВБазе", Истина);
	КонецЕсли;
	
	ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	Элементы.СопоставленныеАналоги.ОтборСтрок = ОтборСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокуДерева()
	
	ТекущиеДанные = Элементы.ДеревоДляОтображения.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемаяСтрока = ДеревоДляОтображения.НайтиПоИдентификатору(ТекущиеДанные.ПолучитьИдентификатор());
	Родитель = УдаляемаяСтрока.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда
		ДеревоДляОтображения.ПолучитьЭлементы().Удалить(УдаляемаяСтрока);
	Иначе
		Родитель.ПолучитьЭлементы().Удалить(УдаляемаяСтрока);
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура();
	
	Если Родитель = Неопределено Тогда
		// Удаляем все строки с этим МНН.
		СтруктураПоиска.Вставить("МНН", ТекущиеДанные.МНН);
	Иначе
		// Удаление конкретной строки по ключу связи.
		СтруктураПоиска.Вставить("КлючСвязи", ТекущиеДанные.КлючСвязи);
	КонецЕсли;
	
	НайденныеПозицииКУдалению = ТаблицаЗагрузки.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаТЧ Из НайденныеПозицииКУдалению Цикл
		ТаблицаЗагрузки.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	СопоставленныеАналогиКУдалению = СопоставленныеАналоги.НайтиСтроки(СтруктураПоиска);
	Для Каждого СтрокаТЧ Из СопоставленныеАналогиКУдалению Цикл
		СопоставленныеАналоги.Удалить(СтрокаТЧ);
	КонецЦикла;
	
	Если Родитель <> Неопределено Тогда
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("МНН", Родитель.МНН);
		СтруктураПоиска.Вставить("ОбратныйКлючСвязи",  ТекущиеДанные.КлючСвязи);
		
		СопоставленныеАналогиОбратныеКУдалению = СопоставленныеАналоги.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТЧ Из СопоставленныеАналогиОбратныеКУдалению Цикл
			СопоставленныеАналоги.Удалить(СтрокаТЧ);
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьКоличественнуюИнформациюВОтборах();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанные()
	
	НачатьТранзакцию();
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		// Нужно обновить существующие записи в регистре сведений,
		//которые были изменены на этапе сопоставления.
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ЕстьВБазе", 	Истина);
		ПараметрыОтбора.Вставить("Выбран",	 	Истина);
		
		СуществующиеВБазе = СопоставленныеАналоги.НайтиСтроки(ПараметрыОтбора);
		Если СуществующиеВБазе.Количество() > 0 Тогда
			
			// Удалим записи по отбору.
			НаборЗаписей = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей();
			
			Для Каждого Строка Из СуществующиеВБазе Цикл
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Номенклатура 	= Строка.НоменклатураБазы;
				НоваяЗапись.Аналог 			= Строка.АналогБазы;
			КонецЦикла;
			
			НаборЗаписей.Записать(ОбщегоНазначения.РежимУдаленияНабораЗаписей());
		
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("Выбран", Истина);
		
		ВыбранныеПозиции = СопоставленныеАналоги.НайтиСтроки(ПараметрыОтбора);
		Если ВыбранныеПозиции.Количество() > 0 Тогда
			
			// Добавим новые записи.
			НаборЗаписей = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей();
			
			Для Каждого СтрокаАналога Из ВыбранныеПозиции Цикл
				
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаАналога);
				
				СтрокаАналога.ЕстьВБазе 		= Истина;
				СтрокаАналога.НоменклатураБазы 	= СтрокаАналога.Номенклатура;
				СтрокаАналога.АналогБазы 		= СтрокаАналога.Аналог;
				
				ОбновитьПризнакЕстьВБазеВТаблицах(СтрокаАналога.КлючСвязи);
				
			КонецЦикла;
			
			НаборЗаписей.Записать(ОбщегоНазначения.РежимСлиянияНабораЗаписей());
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Загрузка выполнена успешно!'"));
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Не удалось загрузить аналоги по причине: %1'"), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПризнакЕстьВБазеВТаблицах(КлючСвязи)
	
	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("КлючСвязи", КлючСвязи);
	
	НайденныеСтрокиТЗ = ТаблицаЗагрузки.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтрокиТЗ.Количество() > 0 Тогда
		НайденныеСтрокиТЗ[0].ЕстьВБазе = Истина;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		Для Каждого ДочернийУзел Из СтрокаДерева.ПолучитьЭлементы() Цикл
			Если ДочернийУзел.КлючСвязи = КлючСвязи Тогда
				ДочернийУзел.ЕстьВБазе = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущуюСтраницуСопоставлениеДанных()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.СопоставлениеДанных;
	Элементы.Назад.Видимость = Ложь;
	Элементы.Далее.Заголовок = НСтр("ru='Загрузить'");
	Элементы.ДекорацияЗаголовок.Заголовок = НСтр("ru='Сопоставление данных'");
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьВыбранныеНаСервере()
	
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("Выбран", 		 Истина);
	СтруктураПоиска.Вставить("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	
	СтрокиДляСопоставления = ТаблицаЗагрузки.НайтиСтроки(СтруктураПоиска);
	Если СтрокиДляСопоставления.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаКСопоставлению = ТаблицаЗагрузки.Выгрузить(СтрокиДляСопоставления);
	
	Обработки.ор_ЗагрузкаАналогов.СопоставитьСНоменклатуройПоПараметрамИзФайла(ТаблицаКСопоставлению);
	
	// За один проход нельзя обновить номенклатуру, найти аналоги и обновить обратные ключи связи.
	// Нужно три прохода
	
	Для Каждого СопоставленнаяСтрока Из ТаблицаКСопоставлению Цикл
		
		Если Не ЗначениеЗаполнено(СопоставленнаяСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("КлючСвязи", СопоставленнаяСтрока.КлючСвязи);
		
		СтрокиДляСопоставления = ТаблицаЗагрузки.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДляСопоставления.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиДляСопоставления[0].Номенклатура = СопоставленнаяСтрока.Номенклатура;
		СтрокиДляСопоставления[0].НоменклатураЗаполнена = Истина;
		
	КонецЦикла;
	
	ДопПараметры = Новый Структура();
	ДопПараметры.Вставить("ТаблицаЗагрузки",		 ТаблицаЗагрузки.Выгрузить());
	ДопПараметры.Вставить("СопоставленныеАналоги",	 СопоставленныеАналоги.Выгрузить());
	
	КопияТаблицыКСопоставлению = ТаблицаКСопоставлению.Скопировать();
	КопияТаблицыКСопоставлению.Свернуть("МНН");
	
	Для Каждого Строка Из КопияТаблицыКСопоставлению Цикл
		
		СтруктураПоиска = Новый Структура();
		СтруктураПоиска.Вставить("МНН", Строка.МНН);
		
		СтрокиДляСопоставления = ДопПараметры.ТаблицаЗагрузки.НайтиСтроки(СтруктураПоиска);
		Если СтрокиДляСопоставления.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаАналог Из СтрокиДляСопоставления Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаАналог.Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
		
			Обработки.ор_ЗагрузкаАналогов.НайтиИЗаполнитьАналогиПоТекущейНоменклатуре(
				СтрокаАналог,
				ДопПараметры);
				
			ОбновитьДеревоПослеСопоставления(СтрокаАналог);
		
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СопоставленнаяСтрока Из СтрокиДляСопоставления Цикл
		
		Если Не ЗначениеЗаполнено(СопоставленнаяСтрока.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Обработки.ор_ЗагрузкаАналогов.ОбновитьОбратныеКлючиСвязи(
			СопоставленнаяСтрока,
			ДопПараметры);
		
	КонецЦикла;
	
	ТаблицаЗагрузки.Загрузить(ДопПараметры.ТаблицаЗагрузки);
	СопоставленныеАналоги.Загрузить(ДопПараметры.СопоставленныеАналоги);
	
	ОбновитьКоличественнуюИнформациюВОтборах();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоПослеСопоставления(СтрокаТаблицыЗагрузки)
	
	Для Каждого СтрокаДерева Из ДеревоДляОтображения.ПолучитьЭлементы() Цикл
		Для Каждого ДочернийУзел Из СтрокаДерева.ПолучитьЭлементы() Цикл
			Если ДочернийУзел.КлючСвязи = СтрокаТаблицыЗагрузки.КлючСвязи Тогда
				ДочернийУзел.ЕстьВБазе		= СтрокаТаблицыЗагрузки.ЕстьВБазе;
				ДочернийУзел.Номенклатура 	= СтрокаТаблицыЗагрузки.Номенклатура;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
